In [1]:

import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
arr1 = np.arange(9).reshape(3,3)

In [3]:
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [4]:
np.concatenate([arr1,arr1],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [6]:
np.concatenate([arr1,arr1],axis=0)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [15]:
ser1 = Series([0,1,2],index=['T','U','V'])

In [8]:
ser2 = Series([3,4],index=['X','Y'])

In [16]:
pd.concat([ser1,ser2])

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [17]:
ser1

T    0
U    1
V    2
dtype: int64

In [12]:
ser2

X    3
Y    4
dtype: int64

In [23]:
pd.concat([ser1,ser2],axis=1,sort=True)

     0    1
T  0.0  NaN
U  1.0  NaN
V  2.0  NaN
X  NaN  3.0
Y  NaN  4.0

In [24]:
pd.concat([ser1,ser2], keys=['ser1','ser2'])

ser1  T    0
      U    1
      V    2
ser2  X    3
      Y    4
dtype: int64

In [26]:
pd.concat([ser1,ser2], keys=['ser1','ser2'],axis=1,sort=True)

   ser1  ser2
T   0.0   NaN
U   1.0   NaN
V   2.0   NaN
X   NaN   3.0
Y   NaN   4.0

In [27]:
dframe1 = DataFrame(np.random.randn(4,3), columns=['X', 'Y', 'Z'])

In [28]:
dframe1

          X         Y         Z
0 -0.278062 -0.061992  0.717151
1  0.483495  0.853995 -0.100860
2 -1.522075  0.210359  0.145705
3  1.635113 -0.082272 -0.937945

In [29]:
dframe2 = DataFrame(np.random.randn(3, 3), columns=['Y', 'Q', 'X'])

In [30]:
dframe2

          Y         Q         X
0 -0.069513  0.122342  2.123024
1  1.520792 -0.712294  0.602257
2  0.346280  0.359440 -0.684879

In [33]:
pd.concat([dframe1,dframe2],sort=True)

          Q         X         Y         Z
0       NaN -0.278062 -0.061992  0.717151
1       NaN  0.483495  0.853995 -0.100860
2       NaN -1.522075  0.210359  0.145705
3       NaN  1.635113 -0.082272 -0.937945
0  0.122342  2.123024 -0.069513       NaN
1 -0.712294  0.602257  1.520792       NaN
2  0.359440 -0.684879  0.346280       NaN

In [35]:
pd.concat([dframe1,dframe2],sort=True,ignore_index=True)

          Q         X         Y         Z
0       NaN -0.278062 -0.061992  0.717151
1       NaN  0.483495  0.853995 -0.100860
2       NaN -1.522075  0.210359  0.145705
3       NaN  1.635113 -0.082272 -0.937945
4  0.122342  2.123024 -0.069513       NaN
5 -0.712294  0.602257  1.520792       NaN
6  0.359440 -0.684879  0.346280       NaN